10/data/attachments/2674e2cbf2d71ad1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e640d8d4-cc95-4499-a45e-95bdf4047d43</nif:username>
            <nif:friendToBeAdded>Isaiah_start_Friend_19100_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>